In [1]:
import pyodbc
import pandas as pd

In [2]:
connection_str = "DRIVER={ODBC Driver 17 for SQL Server};SERVER=localhost;UID=SA;PWD=Goodness15."
# conn = pyodbc.connect(connection_str, autocommit=True)
# cur = conn.cursor()

In [10]:
cur.execute("SELECT @@version;") 
row = cur.fetchone() 
while row: 
    print(row[0])
    row = cur.fetchone()

Microsoft SQL Server 2019 (RTM-CU10) (KB5001090) - 15.0.4123.1 (X64)
	Mar 22 2021 18:10:24
	Copyright (C) 2019 Microsoft Corporation
	Express Edition (64-bit) on Linux (Ubuntu 20.04.2 LTS) <X64>

In [16]:
cur.execute('create database firstdb')

In [17]:
cur.execute('use firstdb')

In [9]:
cur.execute('select name from sys.databases')

In [10]:
row = cur.fetchone() 
while row: 
    print(row[0])
    row = cur.fetchone()

master
tempdb
model
msdb

In [7]:
cur.execute('drop database firstdb')

In [11]:
df = pd.read_csv("Sales Analysis Data/Products.csv", encoding='latin-1')
df

,ProductID,ProductName,SupplierID,CategoryID,Unit,Price
0,1,Chais,1,1,10 boxes x 20 bags,18.00
1,2,Chang,1,1,24 - 12 oz bottles,19.00
2,3,Aniseed Syrup,1,2,12 - 550 ml bottles,10.00
3,4,Chef Anton's Cajun Seasoning,2,2,48 - 6 oz jars,22.00
4,5,Chef Anton's Gumbo Mix,2,2,36 boxes,21.35
...,...,...,...,...,...,...
72,73,Röd Kaviar,17,8,24 - 150 g jars,15.00
73,74,Longlife Tofu,4,7,5 kg pkg.,10.00
74,75,Rhönbräu Klosterbier,12,1,24 - 0.5 l bottles,7.75
75,76,Lakkalikööri,23,1,500 ml,18.00
76,77,Original Frankfurter grüne Soße,12,2,12 boxes,13.00

In [10]:
df = pd.read_csv("Sales Analysis Data/Orders.csv", encoding='latin-1')
df

     OrderID  CustomerID  EmployeeID  OrderDate  ShipperID
0      10248          90           5   7/4/1996          3
1      10249          81           6   7/5/1996          1
2      10250          34           4   7/8/1996          2
3      10251          84           3   7/8/1996          1
4      10252          76           4   7/9/1996          2
..       ...         ...         ...        ...        ...
191    10439          51           6   2/7/1997          3
192    10440          71           4  2/10/1997          2
193    10441          55           3  2/10/1997          2
194    10442          20           3  2/11/1997          2
195    10443          66           8  2/12/1997          1

[196 rows x 5 columns]

In [12]:
df = pd.read_csv("Sales Analysis Data/Customers.csv", encoding='latin-1')

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 91 entries, 0 to 90
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   CustomerID    91 non-null     int64
 1   CustomerName  91 non-null     object
 2   ContactName   91 non-null     object
 3   Address       91 non-null     object
 4   City          91 non-null     object
 5   PostalCode    90 non-null     object
 6   Country       91 non-null     object
dtypes: int64(1), object(6)
memory usage: 5.1+ KB

In [3]:
for i, row in df.iterrows():
    r =

CategoryID                                                1
CategoryName                                      Beverages
Description     Soft drinks, coffees, teas, beers, and ales
Name: 0, dtype: object
CategoryID                                                      2
CategoryName                                           Condiments
Description     Sweet and savory sauces, relishes, spreads, an...
Name: 1, dtype: object
CategoryID                                        3
CategoryName                            Confections
Description     Desserts, candies, and sweet breads
Name: 2, dtype: object
CategoryID                   4
CategoryName    Dairy Products
Description            Cheeses
Name: 3, dtype: object
CategoryID                                        5
CategoryName                         Grains/Cereals
Description     Breads, crackers, pasta, and cereal
Name: 4, dtype: object
CategoryID                   6
CategoryName      Meat/Poultry
Description     Prepared meats
Name: 5, dtype: object
CategoryID                              7
CategoryName                      Produce
Description     Dried fruit and bean curd
Name: 6, dtype: object
CategoryID                     8
CategoryName             Seafood
Description     Seaweed and fish
Name: 7, dtype: object

In [21]:
query = 'CREATE TABLE categories (category_ID int, category_name text, description text)'
cur.execute(query)

In [49]:
query = "BULK INSERT categories from '/home/tochi/Documents/sales-analysis-project/Sales Analysis Data/Categories.csv'\
with (FORMAT = 'CSV', CODEPAGE='RAW', FIELDTERMINATOR=',', ROWTERMINATOR='\r\n', FIRSTROW=2)"
cur.execute(query)

In [69]:
cur.execute('select * from categories')

row = cur.fetchone() 
while row: 
    print(row[0], row[1], row[2])
    row = cur.fetchone()

In [70]:
row = cur.fetchall()

In [75]:
df2 = pd.DataFrame(row)

In [76]:
df2

                                                   0
0  [1, Beverages, Soft drinks, coffees, teas, bee...
1  [2, Condiments, Sweet and savory sauces, relis...
2  [3, Confections, Desserts, candies, and sweet ...
3                       [4, Dairy Products, Cheeses]
4  [5, Grains/Cereals, Breads, crackers, pasta, a...
5                  [6, Meat/Poultry, Prepared meats]
6            [7, Produce, Dried fruit and bean curd]
7                     [8, Seafood, Seaweed and fish]

In [98]:
cus = pd.read_csv('Sales Analysis Data/Suppliers.csv', encoding='latin-1')

In [99]:
cus.columns

Index(['SupplierID', 'SupplierName', 'ContactName', 'Address', 'City',
       'PostalCode', 'Country', 'Phone'],
      dtype='object')

In [101]:
type(cus['Phone'].iloc[0])

str

In [100]:
cus.head()

,SupplierID,SupplierName,ContactName,Address,City,PostalCode,Country,Phone
0,1,Exotic Liquid,Charlotte Cooper,49 Gilbert St.,Londona,EC1 4SD,UK,(171) 555-2222
1,2,New Orleans Cajun Delights,Shelley Burke,P.O. Box 78934,New Orleans,70117,USA,(100) 555-4822
2,3,Grandma Kelly's Homestead,Regina Murphy,707 Oxford Rd.,Ann Arbor,48104,USA,(313) 555-5735
3,4,Tokyo Traders,Yoshi Nagase,9-8 Sekimai Musashino-shi,Tokyo,100,Japan,(03) 3555-5011
4,5,Cooperativa de Quesos 'Las Cabras',Antonio del Valle Saavedra,Calle del Rosal 4,Oviedo,33007,Spain,(98) 598 76 54

In [1]:
%load_ext sql

In [3]:
%sql $connection_str

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [ ]:
df.to_sql